[
  [
    "When In Anger",
    "اَعُوْذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيْمِ",
    "I seek refuge in Al’laah from Shaitaan the curs - Tirmizi Shareef Vol.2 Pg.183",
    "From this hadith it becomes evident that being in the state of anger is being under the influence of Satan. Therefore, when it comes to avoiding Satan or controlling his induced temptations, there is no better refuge than Allah Almighty. Hence, whenever in anger, a Muslim must recite this Dua and seek the help of Allah Almighty."
  ],
  [
    "Before Meal",
    "بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيْمِ",
    "Al’laah’s Name we begin with, The Compassionate, Most Merciful.",
    "The essence of this Duas is of thanking Allah Almighty for all the Mercy and Blessings He has bestowed upon Muslims in the form of meal."
  ],
  [
    "After Meal",
    "اَ لْحَمْدُ للهِ الَّذِىْ اَطْعَمَنَا وَسَقَاناَ وَجَعَلَناَ مِنَ الْمُسْلِمِيْنَ",
    "All Praise is due to Al’laah, who has blessed us with food and drink and made us from amongst the Believers (Muslims)”. [Abu Dawood Pg.573]",
    "The essence of this Duas is of thanking Allah Almighty for all the Mercy and Blessings He has bestowed upon Muslims in the form of meal."
  ],
  [
    "When Entering Masjid",
    "اللّهُـمَّ افْتَـحْ لي أَبْوابَ رَحْمَتـِك",
    "O Allaah, open the doors of Your Mercy for me.” [Sahi’h Muslim]",
    "Thus when entering and exiting mosque, a Muslim must ask for the Mercy and Grace of Allah Almighty."
  ],
  [
    "When Exiting Masjid",
    "اللّهُـمَّ إِنّـي أَسْأَلُكَ مِـنْ فَضْـلِك",
    "O Allaah, I seek of You Your Grace.” [Sahi’h Muslim]",
    "Thus when entering and exiting mosque, a Muslim must ask for the Mercy and Grace of Allah Almighty."
  ],
  [
    "When Sneezing",
    "الْحَمْدُ لِلَّهِ",
    "Thanks and all praise be to Allah",
    ""
  ],
  [
    "Who listens to the sneeze",
    "يَرْحَمُكَ اللَّهُِ",
    "May Allah have mercy on you",
    ""
  ],
  [
    "EnteringHome",
    "بِسْمِ اللهِ تَوَكَّلْتُ عَلىَ اللهِ وَلاَ حَوْلَ وَلاَ قُوَّةَ اِلاَّ بِاللهُِِ",
    "Al’laah’s Name we begin with, I place my (full) trust in Al’laah and there is no Might and Power except with Al’laah.- [Tirmizi Shareef Vol.2 Pg.180]",
    ""
  ],
  [
    "Leaving Home",
    "بِسْـمِ اللهِ وَلَجْنـا، وَبِسْـمِ اللهِ خَـرَجْنـا، وَعَلـى رَبِّنـا تَوَكّلْـنا",
    "In the Name of Allah we enter, in the Name of Allah we leave, and upon our Lord we depend [then say As-Salaamu ‘Alaykum to those present].- [Abu Dau’d]",
    ""
  ],
  [
    "When Feeling Stressed",
    "لآَ اِلَهَ اِلاَّ اللهُ الْحَلِيْمُ الْحَكِيْمُ لآَ اِلَهَ اِلاَّ اللهُ رَبُّ الْعَرْشِ الْعَظِيْم--لآَ اِلَهَ اِلاَّ اللهُ رَبُّ السَّمَاوَاتَ وَاْلاَرْضِ وَرَبُّ الْعَرْشِ الْكَرِيْمِ",
    "There is none worthy of worship except Al’laah, The Fore-bearing, The All Wise. There is none worthy of worship except Al’laah, The Lord of the Exalted Throne. There is none worthy of worship except Al’laah, The Lord of the Skies and The Lord of the Earth and the Lord of the distinguished Throne.- [Tirmidhi Vol.2 Pg. 181]",
    "This Dua under stress shows the submissiveness of a person to the Authority and Supremacy of Allah Almighty, which represents the ideology that only He is the one Who can provide relief or assistance during stressful and discomforting situations."
  ],
  [
    "While Traveling",
    "سُبْحَنَ الَّذِىْ سَخَّرَلَنَا هَذَا وَ مَا كُنَّا لَهُ مُقْرِنِيْنْ وَ اِنَّا اِلَى رَبِّنَا لَمُنْقَلِبُوْنْ",
    "Glory be to Al’laah who has given us control over this (mode of transport) and without his Grace we would not have been able to control it and undoubtedly we are to return towards our Lord.- [Tirmizi, Abu Dawood]",
    "No matter how small a distance is or whatever means of traveling is to be adopted, there is always a concern of safety with traveling. Therefore, it is imperative that a person asks for the protection and safety of Allah Almighty."
  ]
]